name: "convolution"

input: "data"
input_dim: 1
input_dim: 3
input_dim: 224
input_dim: 224

layer {
	bottom: "data"
	top: "conv"
	name: "conv"
	type: "Convolution"
	param {
		lr_mult: 0.0
	}
	param {
		lr_mult: 0.0
	}
	convolution_param {
		num_output: 64
		pad: 1
		kernel_size: 3
		stride: 1
		weight_filler {
		 type: "gaussian"
		 std: 0.01
		}
		bias_filler {
		 type: "constant"
		 value: 0
		}
	}
}